[
    {
        "isbn": "9784297106614",
        "title": "ゼロからわかるAmazon Web Services超入門",
        "authors": [
            "大澤文孝"
        ],
        "description": "AWSでWebサイトを構築・運用!実際に動かして学べる1冊。練習問題&解答・解説集付き。",
        "categories": null
    },
    {
        "isbn": "9784297108892",
        "title": "図解即戦力 Amazon Web Servicesのしくみと技術がこれ1冊でしっかりわかる教科書",
        "authors": [
            "小笠原種高"
        ],
        "description": "Amazon Web Servicesのしくみがキーワードベースでわかる!ネットワーク&クラウドの基本からAWSの各サービスまで初心者や非エンジニアにもわかりやすく解説!!",
        "categories": null
    },
    {
        "isbn": "9784798162560",
        "title": "AWSクラウドの基本と仕組み",
        "authors": [
            "亀田 治伸",
            "山田 裕進"
        ],
        "description": "AWS入門書の決定版 アマゾン ウェブ サービス(AWS)社のプロダクトマーケティング エバンジェリスト 亀田治伸氏、およびテクニカルトレーナ 山田裕進氏の執筆による、AWSの利用を前提としたクラウド入門。 一般的なクラウドコンピューティングの概要、AWSクラウドの基礎知識、概念、テクノロジー、セキュリティ、代表的なサービスなどについて理解できる。付録では、AWSの料金、セミナー・イベントおよびトレーニング、AWS認定、アカウント設定などについて解説。さらにAWSの主なサービスの一覧を掲載。 クラウドコンピューティングおよびAWSについての実用的な情報を求める様々な方に最適。 【対象読者】 ・IT企業の新入社員 ・情報システム部/経営企画部の方 ・中小企業の経営者 ・IT企業の営業担当 ・AWSパートナー企業 ・ITに意識高いビジネスパーソン ・他の分野からクラウド分野へ転身の開発者 【目次】 第1章 クラウドコンピューティングの特徴とメリット ―はじめてのAWS― 第2章 ITシステムの使用例とAWSの主要サービス ―AWSはどんなときに使う?― 第3章 AWS導入のメリットその1 ―ネットワーク&コンピューティングを活用する― 第4章 AWS導入のメリットその2 ―ストレージを活用する― 第5章 AWS導入のメリットその3 ―データベースを活用する― 第6章 AWS導入のメリットその4 ―クラウドセキュリティの考え方― 第7章 新しいテクノロジーへの取り組みとクラウドネイティブ開発 ―これからの時代に求められるスキルと人材― 付録A AWSのご利用にあたって 付録B AWSサービス一覧 ※本電子書籍は同名出版物を底本として作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)",
        "categories": null
    },
    {
        "isbn": "9784296202041",
        "title": "Amazon Web Services基礎からのネットワーク&サーバー構築改訂4版",
        "authors": [
            "大澤文孝",
            "玉川憲",
            "片山暁雄",
            "今井雄太"
        ],
        "description": "AWSを使ってインフラの基本を学べる本。「クラウドを触って学ぶ」コンセプトが広く受け入れられ、版を重ねる定番本の最新版",
        "categories": null
    },
    {
        "isbn": "9784797392562",
        "title": "Amazon Web Services 業務システム設計・移行ガイド",
        "authors": [
            "佐々木拓郎",
            "林晋一郎",
            "瀬戸島敏宏",
            "宮川亮",
            "金澤圭"
        ],
        "description": "社内システムのクラウド化を目指す人に！ ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 オンプレミスからクラウドへ！ ECサイトから基幹システムまで、 企業のデータ・サーバをAWSへ移行するための ネットワーク設計・構築、運用・管理のノウハウを紹介 オンプレミス上に構築された業務システムをAWS上に移行するための「サービスの選定」「ネットワーク設計・構築」「サーバとデータの移し方」「運用・監視体制の構築」など。これまで多くの企業にAWSを導入し、コンサルティングフェーズから実際の設計・開発、運用フェーズまでの全行程に携わってきた著者陣のノウハウを凝縮して、一般的な企業にAWSを導入する際のベストプラクティスをお届けします。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784844381679",
        "title": "Amazon Web Servicesネットワーク入門",
        "authors": [
            "大澤文孝"
        ],
        "description": "AWSのVirtual Private Cloudサービスを基礎から解説。VPC領域の作成・EC2インスタンスへのIPアドレスの割り当て。セキュリティ機能・プライベートなネットワーク運用。DNSサーバーと独自ドメインの運用。",
        "categories": null
    },
    {
        "isbn": "9784798136578",
        "title": "スラスラわかるC++",
        "authors": [
            "矢沢久雄"
        ],
        "description": "ベストセラー著者による C++入門書の新定番 プログラミング言語C++は、ゲームプログラムなど高度・高速な処理を求められる分野で幅広く利用されているポピュラーな言語のひとつです。本書は「プログラミングの知識ゼロ」という状態から、プログラミングの基礎知識や作法、言語の基本構文、基本テクニックなどを無理なく習得し、プログラムを自力で作れるようになるところまでをしっかりとフォローします。 数多くのベストセラーがあり、Webメディアや新人研修でも活躍している矢沢久雄氏を著者に迎え、プログラミングの楽しさを実感できる紙面構成を目指しました。他の入門書で挫折した方やプログラミングに苦手意識を持っている方にもおすすめできる一冊です。 ※本電子書籍は同名出版物を底本とし作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)",
        "categories": [
            "Technology & Engineering"
        ]
    },
    {
        "isbn": "9784797377026",
        "title": "新・明解C言語 入門編",
        "authors": [
            "柴田望洋"
        ],
        "description": "超ベスト＆超ロングセラーの大改訂版 ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 日本で最も多くの読者を獲得しているC言語入門書の大改訂版、ここに誕生。適切なサンプルプログラムと図表を使って、一つ一つのステップを着実に進めていく、語り口調の解説により、C言語の基礎を確実にマスターできます。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784797397161",
        "title": "新・明解C++で学ぶオブジェクト指向プログラミング",
        "authors": [
            "柴田望洋"
        ],
        "description": "『新・明解C++入門』の姉妹編、ここに刊行 ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 C++を用いてオブジェクト指向プログラミングの基礎を学習するための入門書です。 まずは、クラスの基礎から学習を始めます。データと、それを扱う手続きとをまとめることによってクラスを作成します。それから、派生・継承、仮想関数、抽象クラス、例外処理、クラステンプレートなどを学習し、オブジェクト指向プログラミングの核心へと話が進んでいきます。その過程で、C++という言語の本質と、オブジェクト指向プログラミングに対する理解を深めていきます。最後の三つの章では、ベクトル、文字列、入出力ストリームといった、重要かつ基本的なライブラリについて学習します。 本書を通して、読者は、C++という言語の本質と、オブジェクト指向プログラミングに対する理解を深めることができるでしょう。 なお、本書は、『新・明解C++入門』（2017年12月刊行）の姉妹編であり、『新・明解C++入門』でC++の基礎を学んだ読者にとって最適なテキストです。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784798054278",
        "title": "現場ですぐに使える!C/C++逆引き大全560の極意",
        "authors": [
            "増田智明"
        ],
        "description": "基礎から便利技までコーディングテクニックが満載!そのまま流用できる豊富なサンプルプログラム!アプリケーション開発に必要な知識をコンパクトに解説!27の分類で目的のクラス、メソッドがすぐに探せる!",
        "categories": null
    },
    {
        "isbn": "9784774161839",
        "title": "iPhone／iPad開発ポケットリファレンス",
        "authors": [
            "WINGSプロジェクト",
            "片渕彼富"
        ],
        "description": null,
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784873110639",
        "title": "C++プログラミング入門",
        "authors": [
            "グレゴリー サティア",
            "ダウグブラウン"
        ],
        "description": "本書は、1996年の発行以来、C++言語の定番書となった書物の新版である。新版の発行にあたり、古くなった情報を見直し、加筆/修正した。CプログラマがC++言語を修得することを念頭におき構成し、つまずきやすい落とし穴やプログラミングのコツを数多く掲載し、C++の基礎をわかりやすく解説。C++プログラミングの基礎を確実かつ素早く習得するための必読の書。また、セミナーや講習等の教材としても好適。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784810180473",
        "title": "プログラミング言語C++",
        "authors": [
            "Bjarne Stroustrup",
            "信男·斎藤"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784295007807",
        "title": "スッキリわかるJava入門 第3版",
        "authors": [
            "中山 清喬",
            "国本 大悟",
            "株式会社フレアリンク"
        ],
        "description": "発売から8年であっという間に総計40万部到達した大人気シリーズの原点。 「どうして？」「なぜそうなる？」が必ずわかるJava入門書史上最強の定番書の増補改訂版登場！ 従来の入門書は、先生が生徒が一方的に話し続けるようなスタイルで構成されているモノが多く、それらは途中初学者が思い浮かべる「なぜ？」「どうして？」を置き去りにしたまま次の解説に移っていくため、理解が進まず多くの挫折を生み出してきました。 本書は、初学者がよくつまずくポイントや疑問点に対して、いろいろな角度から具体的なアドバイスを行っているため、まだ腑に落ちていないのに勝手にストーリーが進むということがなく、一歩一歩着実に理解を深めて、無駄なく短期間で知識を習得できる構成になっています。 また、主人公の新人エンジニア湊君が、仲間や先輩とのやりとりの中で徐々に成長していくストーリーを傍らに学んでいくので、飽きることなく楽しくJavaが身に付く仕掛けになっています。 プログラミング入門者のネックとなる「開発環境の準備」には、仮想開発環境「dokojava」を読者特典として用意。 「多発するエラーへの対応」にはFAQ集「エラー解決・虎の巻」が付いていますので、安心して学習を進められます。 第3版では、Java11を基準に内容を改訂し、実務で頻用するコレクションなどの解説を新たに取り込みました。また、好評の仮想開発環境「dokoJava」をブラッシュアップして使い勝手を高めたほか、紙面上の主要ソースコードにQRコードを配し、より学習しやすくなるよう細部に工夫を加えています。 本書でぜひ、Javaプロフェッショナルへの第一歩を踏みだしてください！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784797355727",
        "title": "やさしいJava",
        "authors": [
            "高橋麻奈"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784295008552",
        "title": "スラスラ読める Javaふりがなプログラミング",
        "authors": [
            "谷本 心",
            "リブロワークス"
        ],
        "description": "「プログラムの読み方をすべて載せる（ふりがなをふる）」 という手法で究極のやさしさを目指した、 まったく新しいJava（ジャバ）の入門書です。 本書内に登場するプログラムの読み方をすべて載せ、 さらに、漢文訓読の手法を取り入れ、読み下し文を用意。 プログラムの1行1行が何を意味していて、 どう動くのかが理解できます。 この新しいアプローチで「自分がいま何をしているのかわからない」といった プログラミング入門者が途中で挫折してしまう原因を解決しました。 また、実際に手を動かしながら進むだけでなく、 プログラムを考える応用問題も用意しているため、 しっかりJavaの基礎文法を身につけることができます。 ■本書はこんな人におすすめ ・Javaの基礎を身につけたい人 ・過去にJavaの入門書で挫折してしまった人 ・プログラマーやエンジニアを目指す人 ・仕事でJavaを活用してみたい人 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784815606015",
        "title": "新・明解Java入門　第２版",
        "authors": [
            "柴田望洋"
        ],
        "description": "Java入門書の最高峰！！ ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 シリーズ累計120万部突破！！ 「Java入門書の最高峰」と多くの読者から絶賛された前著（2016年刊行）の改訂版です。 たくさんの図表とサンプルプログラムを使って、Javaの基礎から、オブジェクト指向プログラミングの本質までをわかりやすく解き明かします。 今回の改訂にあたっては、最新のJavaに対応させるとともに、文章とレイアウトを全面的に見直し、一段と読みやすく、理解しやすい内容になっています。 初めてプログラミングを学ぶ人、他の入門書ではマスターできなかった人、本当にJavaをマスターしたい人など、Javaに関心をもつすべての読者にとって、最良の1冊です。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784774171319",
        "title": "ゼロからわかるJava超入門",
        "authors": [
            "佐々木整"
        ],
        "description": "プログラミングの経験がなくても、この1冊でJavaの基礎をしっかりマスターできる!",
        "categories": null
    },
    {
        "isbn": "9784295010333",
        "title": "いちばんやさしいJavaの教本 人気講師が教えるプログラミングの基礎",
        "authors": [
            "石井 真",
            "株式会社カサレアル"
        ],
        "description": "講義+実習のワークショップ形式で、 「シンプルなペットアプリ」を作りながら楽しく学べる 「はじめてでも挫折しない」Javaの入門書です。 なぜそうするのかを知りたい、 仕組みが知りたい、 応用できる基礎を身に付けたい、 そんな読者のさまざまな要望に応える新しい教本です。 講義パートの図解をまじえた解説で仕組みについて理解したあと、 実習パートで実際に手を動かしながらプログラムを書いていきます。 少しずつ新しいことを学びながら進み、プログラムに機能を追加していくので、 いま自分は何をやっているのかを、ちゃんと理解しながら進められます。 もし、つまずいても安心です。 短いレッスンを積み重ねた構成なので、 少し戻って再確認することもしやすくしています。 また、本書で学ぶサンプルプログラムのコードは、 サポートページからダウンロードできるので安心です。 ぜひ本書でJavaのプログラミングの楽しさを実感してください！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784297126858",
        "title": "プロになるJava―仕事で必要なプログラミングの知識がゼロから身につく最高の指南書",
        "authors": [
            "きしだなおき",
            "山本裕介",
            "杉山貴章"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784798167077",
        "title": "Java 第3版 実践編 アプリケーション作りの基本",
        "authors": [
            "三谷 純"
        ],
        "description": "プログラミング学習シリーズJavaが待望の改訂！ 本格的なアプリケーション作りに必要な知識を学ぼう！ 本書は、現在もっとも幅広く使われているプログラミング言語の1つ 「Java」の実践的な入門書です（本書をお読みいただくにあたって、 基礎的なJava言語仕様が前提知識となります。基礎的なJava言語仕様 については、本書シリーズ『Java 第3版 入門編』で解説しています）。 これまで多くの学生にJavaの授業をしてきた筆者が、その経験を活かし、 例外処理やコレクション、ファイルの読み書きといった、本格的な Javaプログラムを記述する際に知っておくべき基本を丁寧にわかりやすく 手ほどきします。これらを身につけることでできることの幅が広がり、 Javaプログラミングがぐっと楽しくなることでしょう。 また、パッケージやスレッド、GUI、ネットワークなど、本格的なアプリケーションを 作るために知っておきたい技術や、ガーベッジコレクションといった プログラマとして押さえておきたい知識にも触れます。 第3版では、Java11および最新の開発環境（Eclipse）に対応、 Swingを利用したGUIアプリケーションの作成など内容の最新化を行っています。 ・Javaプログラミングの実践的な知識を学びたい ・アプリケーション作成に必須の基礎を学びたい ・現場で通用する基礎を身につけたい という方におすすめの1冊です。",
        "categories": null
    },
    {
        "isbn": "9784295011248",
        "title": "スッキリわかるJava入門 実践編 第3版",
        "authors": [
            "中山 清喬",
            "株式会社フレアリンク"
        ],
        "description": "大手ネット書店ベストセラー1位『スッキリわかるJava入門』の、 正統続編である『実践編』に「第3版」が登場！ 最新Java17対応し、近年のJava改訂による新機能（Record等）の取り込みのほか、GitやMavenといったツール類の活用方法も具体的・実践的に解説！ エントリー書の『スッキリわかるJava入門』と同じく、新人エンジニア湊君の成長を傍らに、開発中に発生するJavaのいろんな「なぜ？」に、しっかりと答えながら解説が進んでいき、付録では「エラー解決・虎の巻」を用意して、独学に適した挫折しにくい紙面展開となっています。 各種API・設計手法・開発ツールに至るまで手広くカバーする構成で、中級者に進むあなたを効率的かつ、実践的にエスコートしていきます。 注目の改訂ポイントTOP 5は以下の通り。 【1】最新Java19対応 Record等の新機能紹介のほかJDK新ライセンスモデルの紹介 【2】Git入門（章を全面改訂） 昨今の開発現場に欠かせないGit/ブランチ/GitHubもマスター 【3】Maven（新節として追加） Java開発に不可欠なMaven/POMがわかる・かける 【4】WebAPI（新節として追加） HTTP/RESTの仕組みからマイクロサービス概念まで 【5】GUI開発(新章として追加) 開発現場で保守が続くSwing/AWTアプリにも対応 その他、令和の開発現場にフィットする追補改訂が盛りだくさん！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784798164090",
        "title": "PostgreSQL徹底入門 第4版 インストールから機能・仕組み、アプリ作り、管理・運用まで",
        "authors": [
            "近藤 雄太",
            "正野 裕大",
            "坂井 潔",
            "鳥越 淳",
            "笠原 辰仁"
        ],
        "description": "インストールから機能・仕組み、アプリ作り、管理・運用まで PosgreSQLの基本を一通り学べる定番入門書 PostgreSQLはオープンソースのリレーショナルデータベース管理システム(RDBMS)です。Linux、macOSといったUNIX系OSはもちろんのこと、Windowsにも対応しています。本書は、初めてPostgreSQLに触れる、あるいはそもそもデータベースに触れるのが初めてという方や、ちょっと使ったことはあるけどもう少し詳しく知りたいという方に向けた入門書です。第4版では、PostgreSQL 11をベースに全面的な改訂を行い、新旧問わずPostgreSQLの基本として初学者が押さえておくべきポイントを選別しています。 日ごろからPostgreSQLと深く関わっている執筆陣が、豊富な経験と知識をもとに、そのインストール方法、SQLの使い方から、アプリケーションの作成、そして運用にいたるまでを、さまざまな分野/視点から解説しています。また、PostgreSQLの最新の機能であるロジカルレプリケーションやパラレルクエリに関しても解説しています。 ※本電子書籍は同名出版物を底本として作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)",
        "categories": null
    },
    {
        "isbn": "9784774167558",
        "title": "内部構造から学ぶPostgreSQL 設計・運用計画の鉄則",
        "authors": [
            "勝俣智成",
            "佐伯昌樹",
            "原田登志"
        ],
        "description": null,
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784802612265",
        "title": "SQLデータ分析・活用入門",
        "authors": [
            "西潤史郎"
        ],
        "description": "ビッグデータもスモールデータも欲しいデータは自分で集める。MySQL/PostgreSQL両対応。分析に特化したSQLの基本から一歩踏み込んだ実践テクニックまで。",
        "categories": null
    },
    {
        "isbn": "9784774173016",
        "title": "SQL実践入門",
        "authors": [
            "ミック"
        ],
        "description": "実行計画を読み解きボトルネックを解消する。大量のデータを自在に処理するノウハウ。",
        "categories": null
    },
    {
        "isbn": "9784798176727",
        "title": "アジャイルプラクティスガイドブック チームで成果を出すための開発技術の実践知",
        "authors": [
            "常松 祐一"
        ],
        "description": "チーム・組織にプラクティスを導入し、根付かせるために！ 116の手法を一冊にまとめた“実践”の手引き チームでのアジャイル開発には、開発技術やツールなどの「技術プラクティス」の活用が重要です。 プラクティスはそれぞれの目的や役割を意識することで効果を発揮します。しかし、目まぐるしく状況が変化する開発では、当初の目的を忘れて、プラクティスに取り組むこと自体が目的化してしまうチームも少なくありません。 本書は、チーム・組織でアジャイル開発に取り組んできた著者が、プラクティスの効果的な選択・活用のしかたについて、自らの実践経験に基づいてまとめたガイドブックです。 架空の開発現場を舞台にしたマンガとともに、チーム開発の様々なシーンで役立てられるプラクティスを、幅広くかつわかりやすく解説しています。開発現場に備えておけば、特定のプラクティスについて知りたい、開発の段階に合わせたプラクティスを探したい、といった場面で、必要な項目を調べる辞書として役立てることができるでしょう。プラクティスの導入や実践について、試行錯誤を重ねている開発者におすすめの一冊です。 ●本書で取り上げる開発のシーン 実装方針の検討、タスクの分解、ブランチ戦略の検討、コミット、コードレビュー、複数人での共同作業、テスト、運用を見据えたソースコードの整備、CI/CD、デプロイ、リリース、モニタリング、関係者間の認識合わせ、チーム内外との連携 …など、数々の場面で役立つプラクティスを幅広く収録！ ●こんな課題を感じている方におすすめ ・アジャイル開発を取り入れてみたものの、効果を感じられずにいる ・状況に合わせたプラクティスの選択、導入のやり方がわからない ・プラクティスを実践しているが、その取り組みが適切なのか、確証を持てない ●アジャイル実践者たちによるコラムを収録！ ・グラデーションで考える12年間のアジャイル実践 （きょん） ・ペアプログラミングの効果と影響 （やっとむ（安井力）） ・開発と運用、分けて考えていませんか？―ダッシュボードのその先へ― （河野通宗） ・インフラ構築を自動化しよう （吉羽龍太郎） ・Logging as API contract （牛尾剛） ・開発項目をコンパクトに保つには、クリーンなコード（大谷和紀） ・テスト駆動開発ではTODOリストがテストよりも先 （大谷和紀） ・チームで1つずつ終わらせよう （椎葉光行） ・チームに命を吹き込むゴール設定 （天野祐介） ・AIフレンドリーなドキュメントを書こう （服部佑樹） ・技術的負債―問題発見までの時間とリスクをビジネス側に説明する（川口恭伸）",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784478116692",
        "title": "頭のいい人が話す前に考えていること",
        "authors": [
            "安達裕哉"
        ],
        "description": "コンサルで叩き込まれた、話し方よりも論理的思考よりも大切な、頭のいい人だけが知っている知性と信頼を同時に得る黄金法則",
        "categories": null
    },
    {
        "isbn": "9784163917306",
        "title": "イーロン・マスク上",
        "authors": [
            "ウォルター・アイザックソン"
        ],
        "description": "「私は苦しみが原点なのです」。知られざる壮絶な人生を、ベストセラー「スティーブ・ジョブズ」伝記作家が赤裸々に描く。",
        "categories": null
    },
    {
        "isbn": "9784163917313",
        "title": "イーロン・マスク下",
        "authors": [
            "ウォルター・アイザックソン"
        ],
        "description": "稀代のイノベーターは、人類をどこに導くのか。電気自動車、ツイッター、AI、そして宇宙。壮大なるビジョンが本書で明かされる。",
        "categories": null
    },
    {
        "isbn": "9784815615758",
        "title": "1冊ですべて身につくJavaScript入門講座",
        "authors": [
            "Mana"
        ],
        "description": "【シリーズ累計35万部！】 【全国の書店員がオススメする本 第1位受賞を連発！】 とことん丁寧なJavaScriptの入門書 ついに登場！ ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 ・最初の一歩が踏み出せる！ 初心者に寄り添うやさしい解説 ・最新の技術が身につく！ 今のJavaScriptの書き方・使い方 ・絶対に知っておきたい！ アニメーションとイベントの知識 ・プログラミングの基本から実装方法まですべて学べる Webクリエイターボックスの Manaが教えるプログラミング＆Webサイトの動かし方 この1冊で必要なことがすべて学べる！ プログラムもアニメーションも全部学べる！ サンプルデータはWebサイトよりダウンロードできます。 ●本書の対象読者 ・これからJavaScriptを学びはじめたい人 ・以前にJavaScriptの学習を試みたが挫折してしまった人 ・Webサイトに動きやイベントをつけてみたい人 ・HTMLとCSSの基礎を終え、次の目標を探している人 ・jQueryを卒業し、最新のJavaScriptを学び直したい人 ※カバー画像が異なる場合があります。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784815615499",
        "title": "AWS運用入門",
        "authors": [
            "佐竹陽一",
            "山﨑翔平",
            "小倉大",
            "峯侑資"
        ],
        "description": "現場で役立つ！ AWSトップエンジニアが実践しているシステム運用の手法とコツ ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 本書では「最初に知っておきたいAWS運用のすべて」を体系立てて解説します。 システム運用で利用するEC2・IAM・RDSといった基本的なサービスはもちろん、 意外と知らないバックアップ/リストア、セキュリティ統制、監査に関わるサービスも基本から丁寧に解説。 日々の運用業務の中で「なるべく楽に」「効率的に」AWSでシステムを運用する手法が満載です。 ■本書の対象読者 ・これからシステム運用に関わる新米エンジニアの方々 ・これまでオンプレミスで運用をしてきたエンジニアのみなさま ■こんな悩みが解消します ・便利なアカウント管理の方法は？ ・最適なログの収集と分析方法は？ ・エラーを管理しやすい監視方法は？ ・ヌケモレを防ぐパッチ適用の方法は？ ・簡単なコスト削減の方法は？ ※カバー画像が異なる場合があります。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784862763181",
        "title": "解像度を上げる",
        "authors": [
            "馬田隆明"
        ],
        "description": "「ふわっとしている」「既視感がある」「ピンとこない」 そんな状態を覆す! 解像度が高い人の行動・思考・情報収集の方法。",
        "categories": null
    },
    {
        "isbn": "9784297132880",
        "title": "改訂3版JavaScript本格入門",
        "authors": [
            "山田祥寛"
        ],
        "description": "2010年の刊行から約100,000部の実績を誇るロングセラーを、ECMAScript 2022に対応した内容で200ページ増の大幅改訂。最新の基本文法から、開発に欠かせない応用トピックまで解説します。JavaScriptらしく書くために大切なオブジェクトの扱い方や、大規模開発でさらに実用的になったオブジェクト指向構文を学び、しっかりと動くプログラムの作り方を本質から理解できます。",
        "categories": null
    },
    {
        "isbn": "9784296200917",
        "title": "キーエンス解剖最強企業のメカニズム",
        "authors": [
            "西岡杏"
        ],
        "description": "最強企業のメカニズムキーエンス解剖。外部にほとんど明かされないキーエンスの正体に日経ビジネス記者が迫る。",
        "categories": null
    },
    {
        "isbn": "9784798171548",
        "title": "「技術書」の読書術 達人が教える選び方・読み方・情報発信&共有のコツとテクニック",
        "authors": [
            "増井 敏克",
            "IPUSIRON"
        ],
        "description": "技術書の表も裏も知り尽くした人気作家が、 読書を血肉にするコツとテクニックを教えます。 おそらく本邦初、 「技術書（コンピュータ書）」の 読書術を指南する本が登場！ 次々と新しい技術が登場する時代、 書籍からうまく知識やスキルを 得られるかどうかがIT職のキャリアを 左右するといっても過言ではありません。 技術書の表も裏も知り尽くした 人気作家2名が、その秘訣を教えます。 【本書の内容（一部）】 ・自分に合う本を見つけるために ・プログラミング書のうまい読み方 ・数学書や英語の技術書はどう読む ・効果的な読書メモを取るには ・名著の罠／悪書に当たったら ・エキセントリックな読書術も 【著者】 ●IPUSIRON 2001年に『ハッカーの教科書』（データハウス）を上梓。情報セキュリティと物理的セキュリティを総合的な観点から研究しつつ、執筆を中心に活動中。主な書著に『ハッキング・ラボのつくりかた』『暗号技術のすべて』（翔泳社）、『ホワイトハッカーの教科書』（C&R研究所）、『ハッカーの学校』『ハッカーの学校 個人情報調査の教科書』『ハッカーの学校 鍵開けの教科書』（データハウス）がある。近年は執筆の幅を広げ、同人誌の執筆や翻訳書も手がける。執筆以外に、セキュリティカンファレンス「ゆるいハッキング大会」での講演などがある。 ●増井敏克 増井技術士事務所代表。技術士（情報工学部門）。情報処理技術者試験にも多数合格。また、ビジネス数学検定1級に合格し、公益財団法人日本数学検定協会認定トレーナーとしても活動。「ビジネス」×「数学」×「IT」を組み合わせ、コンピュータを「正しく」「効率よく」使うためのスキルアップ支援や、各種ソフトウェアの開発を行っている。著書に『プログラマ脳を鍛える数学パズル』『IT用語図鑑』『図解まるわかりデータサイエンスのしくみ』（以上、翔泳社）、『プログラミング言語図鑑』（ソシム）、『基礎からのWeb開発リテラシー』（技術評論社）などがある。 【目次】 第1部 選び方 1-1 あらゆる手段で本を見つける！書店の歩き方からITツールの活用法まで（著：増井敏克） 1-2 世界が広がる！貪欲に本を求めれば、出会うはずがない本にも出会える（著：IPUSIRON） 第2部 読み方 2-1 比べて、使い分ける。時間をムダにせず理解を深める（増井敏克） 2-2 ルール無用。精読、多読、乱読し、読書の枠を超えてゆけ（IPUSIRON） 第3部 情報発信＆共有 3-1 成長のチャンスはアウトプットにあり（増井敏克） 3-2 アウトプットも「遅すぎる」ことはない（IPUSIRON）",
        "categories": null
    },
    {
        "isbn": "9784798068169",
        "title": "GoodCode,BadCode〜持続可能な開発のためのｿﾌﾄｳｪｱｴﾝｼﾞﾆｱ的思考",
        "authors": [
            "トム・ロング (ソフトウェア工学)"
        ],
        "description": "プロのソフトウェアエンジニアとして、堅牢で信頼性が高く、保守しやすいコードを書くための概念と実用的な手法を解説",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784802613989",
        "title": "コンサルが「最初の3年間」で学ぶコト知らないと一生後悔する99のスキルと5の挑戦",
        "authors": [
            "高松智史"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784296001231",
        "title": "コンピュータはなぜ動くのか第2版知っておきたいハードウエア&ソフトウエアの基礎知識",
        "authors": [
            "矢沢久雄"
        ],
        "description": "『コンピュータはなぜ動くのか』19年ぶり、待望の改訂第2版!",
        "categories": null
    },
    {
        "isbn": "9784478115824",
        "title": "時間最短化、成果最大化の法則",
        "authors": [
            "木下勝寿"
        ],
        "description": "なぜ、あの人は、私の150倍、成果を出せるのか? 頑張っているのに成果が出ない人に教えてあげたい45の法則。",
        "categories": null
    },
    {
        "isbn": "9784802614061",
        "title": "システム設計の面接試験",
        "authors": [
            "アレックス・シュウ"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784296203239",
        "title": "次世代高速オープンソースRDB Tsurugi",
        "authors": [
            "神林飛志",
            "荒川傑",
            "菱田真人"
        ],
        "description": "“世界最速”の次世代オープンソースRDB「Tsurugi」のすべてがわかる本です。",
        "categories": null
    },
    {
        "isbn": "9784802512572",
        "title": "シビックテックをはじめよう",
        "authors": [
            "シド・ハレル"
        ],
        "description": "「シビックテック」とは、市⺠が主体的に行政組織と連携し、テクノロジーを活用して社会課題を解決したり、生活の利便性を向上させるための取り組みのこと。特にデジタル庁の発足以降、こうした⺠間と公的機関との協働に注目が集まっています。 本書は、米国のシビックテクノロジストの第一人者による、エンジニアやデザイナーが公共部門の中で活動するための知見と心構えを提供する一冊であり、行政DXが求められる今まさに必要とされる内容です。 日本語版寄稿:関治之(Code for Japan 代表理事)、高橋征義(日本Rubyの会代表理事)",
        "categories": null
    },
    {
        "isbn": "9784048931106",
        "title": "JavaScript Primer 改訂2版迷わないための入門書",
        "authors": [
            "azu",
            "Suguru Inatomi"
        ],
        "description": "最新のES2022に対応! 変化に対応できる基礎を身につけよう!",
        "categories": null
    },
    {
        "isbn": "9784815618926",
        "title": "瞬時に「言語化できる人」が、うまくいく。",
        "authors": [
            "荒木俊哉"
        ],
        "description": "●「仕事ができる人」とは、「瞬時に言語化できる人」 「言いたいことが、うまく言葉にできない……」 と悩む人が多い。 例えば、 ・【会議】「どう思う？」と聞かれても、うまく答えられない……。 ・【面接】その会社への「思い」を、うまく言葉にできない……。 ・【企画書】「ぼんやりとしたイメージ」はあるのに、いい言葉が思いつかない……。 本書は、そんな「思いをうまく言葉にできない……」 と悩むビジネスパーソンに向けて、 「言語化力」を鍛えるメソッドを伝えるものだ。 そのメソッドとは、 「頭に思いついたこと」を A4一枚の「メモ」に次々と書いていくだけの 非常にシンプルなトレーニング。 ただし、「1枚2分」の短い制限時間内で「素早く」書く。 1日3枚で終わらせる。 この「言語化力トレーニング」を毎日の習慣にする。 すると、いつでも必要なときに、必要な言葉が、 「瞬時に」出てくるようになる――。 そんな「瞬時に言語化できる」世界へと、あなたをお連れしよう。 世界三大広告賞ほか、国内外20以上のアワード受賞！ 電通トップコピーライターが明かす独自メソッド、初公開！ ※カバー画像が異なる場合があります。",
        "categories": [
            "Business & Economics"
        ]
    },
    {
        "isbn": "9784826902434",
        "title": "情報セキュリティの敗北史",
        "authors": [
            "アンドリュー・スチュワート"
        ],
        "description": "「サイバー攻撃はなぜ増え続けるのか?」 相次ぐ個人情報漏洩、米・中・露による国家主導のハッキング、企業・病院を標的とするランサムウェア... ITの発展に伴いセキュリティ対策も強化された。 一方で、サイバー攻撃による被害は増え続けている。 私たちのシステムは、なぜ脆弱なままなのか? 半世紀以上にわたるサイバー空間の攻防を初めて描いた、情報セキュリティ史の決定版。 歴史の先に未来が見える、情報社会を生きる現代人必読の一冊。 【Cybersecurity Canon Hall of Fame 2022(サイバーセキュリティ書の殿堂)受賞】 ■ ■ ■ 率直に言って、恐ろしい本である。 コンピュータネットワークは兵器となり、 脆弱なITインフラは国家の安全保障にとって、 致命的な脅威となるのだ。 ――リチャード・H・イマーマン(アメリカ外交史学会第40代会長) 私たちが今日直面するセキュリティ問題の多くは、 何十年も前に下された愚かな決定によってもたらされた。 本書は、IT黎明期から現代のクラウドコンピューティングに至るまで、 情報セキュリティの歴史を完全網羅する。 ――ベン・ロスキー(『Computer Security』著者) ■ ■ ■",
        "categories": null
    },
    {
        "isbn": "9784492558225",
        "title": "心理的安全性　最強の教科書",
        "authors": [
            "ピョートル・フェリクス・グジバチ"
        ],
        "description": "グーグルで人材開発＆人材育成を任された第一人者が、職場に心理的安全性を生む「言葉」と「伝え方」を一挙公開！",
        "categories": [
            "Business & Economics"
        ]
    },
    {
        "isbn": "9784478117835",
        "title": "すごい言語化",
        "authors": [
            "木暮太一"
        ],
        "description": "「言いたいことがあるのに、言葉が出てこない」「話してるうちに、何が言いたいか見失う」言語化の悩みを一気に解決!",
        "categories": null
    },
    {
        "isbn": "9784296070558",
        "title": "スタッフエンジニアマネジメントを超えるリーダーシップ",
        "authors": [
            "Will Larson"
        ],
        "description": "進路に悩み始めたソフトウエアエンジニアに大いに示唆を与えるキャリア形成ガイド本。",
        "categories": null
    },
    {
        "isbn": "9784295015963",
        "title": "スッキリわかるサーブレット＆JSP入門 第3版",
        "authors": [
            "国本 大悟",
            "フレアリンク"
        ],
        "description": "Webアプリ開発の基礎をJava標準技術でしっかり学べる 人気ナンバー1！ Webアプリ開発の定番書に第3版登場！ 業務用Webアプリケーション開発で幅広く利用されている「サーブレット」と「JSP」は、非常に強力である一方、独学が難しい技術となっています。 HTMLやHTTPといった各種仕様、セッションやスコープをといった概念ほか、Webアプリ開発に必要な知識は多岐に恒りますが、本書は、その仕組みやコツも含め、「なぜ」「どうして」を突破しながら、楽しく着実にマスターできる1冊となっています。 この第3版では、最新LTSであるJava17に対応したほか、Eclipse最新版に準じた画面やフォルダ構成に解説をアップデートし、開発現場・教育現場での利用により適した形に進化しました。 また、シリーズで好評の「エラー解決・虎の巻」も併せて更新され、つまずいても安心です。 スッキリわかる入門シリーズの『スッキリわかるJava入門』『スッキリわかるJava入門 実践編』『スッキリわかるSQL入門』と合わせて本書で学習すれば、Javaとデータベースを駆使した本格的Webアプリケーションを自由自在に開発できる、ワンランク上のJavaエンジニアにステップアップできます。 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784163917689",
        "title": "世界一流エンジニアの思考法",
        "authors": [
            "牛尾剛"
        ],
        "description": "「手を動かす前に理解に時間をかける」「準備も持ち帰りもやめる」「脳を酷使しない」......圧倒的な生産性を生む最前線のスキルとは?",
        "categories": null
    },
    {
        "isbn": "9784814400317",
        "title": "ソフトウェア設計のトレードオフと誤り",
        "authors": [
            "Tomasz Lelek",
            "Jon Skeet"
        ],
        "description": "ソフトウェアにかかわる人は多くの決断を迫られている。設計の潜在的な問題や限界を学ぶことで、より良い選択ができるようになる。",
        "categories": null
    },
    {
        "isbn": "9784297136338",
        "title": "大規模言語モデル入門",
        "authors": [
            "山田育矢",
            "鈴木正敏",
            "李凌寒"
        ],
        "description": "ChatGPTに代表される大規模言語モデルが自然言語処理の幅広いタスクで高い性能を獲得し、大きな話題となっています。大規模言語モデルは、大規模なテキストデータで訓練された大規模なパラメータで構成されるニューラルネットワークです。2020年以降、自然言語処理や機械学習の知見をもとに、パラメータ数とテキストデータの拡大により、性能が飛躍的に向上しました。 Hugging Face社の\"transformers\"というPythonライブラリを利用することで、プログラミングの経験があれば、モデルの操作やデータからの学習がかんたんにできます。モデルを訓練するための日本語もしくは日本語を含む多言語のデータセットも充実してきており、すぐに業務に使える実用的なモデルを作ることが可能な時代がやってきました。 本書は、大規模言語モデルの理論と実装の両方を解説した入門書です。大規模言語モデルの技術や自然言語処理の課題について理解し、実際の問題に対処できるようになることを目指しています。以下のような構成によって、理論とプログラミングの双方の側面から、大規模言語モデルに関する情報を提供します。 第1章はじめに 第2章 Transformer 第3章大規模言語モデルの基礎 第4章大規模言語モデルの進展 第5章大規模言語モデルのファインチューニング 第6章固有表現認識 第7章要約生成 第8章文埋め込み 第9章質問応答システム",
        "categories": null
    },
    {
        "isbn": "9784000297196",
        "title": "大規模言語モデルは新たな知能か",
        "authors": [
            "岡野原大輔"
        ],
        "description": "新たな知能との付き合い方を考える! どんな仕組みで、何が可能となり、どんな影響があるのか?",
        "categories": null
    },
    {
        "isbn": "9784297131487",
        "title": "[試して理解]Linuxのしくみ ―実験と図解で学ぶOS、仮想マシン、コンテナの基礎知識【増補改訂版】",
        "authors": [
            "武内覚"
        ],
        "description": "ITシステムやソフトウェアの基盤OSとして幅広く使われているLinux。エンジニアとしてLinuxに関する知識はいまや必須とも言えますが、あなたはそのしくみや動作を具体的にイメージすることができるでしょうか。 本書では、Linux OS における、プロセス管理、プロセススケジューラ、メモリ管理、記憶階層、ファイルシステム、記憶階層、そして仮想化機能、コンテナなど、OS とハードウェアに関するしくみがどのように動くのか、実験とその結果を示す豊富なグラフや図解を用いてわかりやすく解説します。 改訂に際しては全面フルカラー化。グラフや図解がさらにわかりやすくなり、ソースコードはC言語から、Go言語とPythonにアップデートしています。さらに仮想化、コンテナなどの章が加わりました。今どきのLinuxのしくみを本書でしっかり理解しておきましょう。",
        "categories": null
    },
    {
        "isbn": "9784839981723",
        "title": "単体テストの考え方/使い方",
        "authors": [
            "Vladimir Khorikov"
        ],
        "description": "質の高いテストを行い、ソフトウェアに価値をもたらそう!",
        "categories": null
    },
    {
        "isbn": "9784802512480",
        "title": "ちいさくはじめるデザインシステム",
        "authors": [
            "大塚亜周",
            "稲葉志奈",
            "金森悠",
            "samemaru",
            "圓山伊吹",
            "植田将基",
            "関口裕"
        ],
        "description": "「だれでも・効率よく・迷わずに。」を実現するデザインシステムの作り方 「デザインシステム」は、デジタルプロダクト開発においてその必要性や役割を言及されることが多い概念で、プロダクトを提供するためのプロダクト、またはインフラとも呼ばれ、日本の企業・組織でも導入が進んでいます。一般的には、「デザインの再現性を高め、一貫した製品体験を効率よく表現すること」を目的に導入される「ドキュメントやリソース群のこと」と説明されます。 プロダクトの重要性が増すにつれ、プロダクトが示す領域も広がり、デザインシステムが取り扱う範囲も広がってきています。見た目のデザインやUIに関するルール・ナレッジだけでなく、ブランドパーソナリティや文章の表現など、ユーザーとのありとあらゆる接点を網羅し体系化する必要が出てきているともいえるでしょう。 しかし、デザインシステムには決まった在り方がなく、組織の数だけ、その目的の数だけ形を変えます。公開されている個別のデザインシステムを見ても、今の自分たちに必要なのか、作れるのか、そして運用できるのか、疑問は尽きないでしょう。 本書は、人事・労務領域の業務アプリケーションSaaSを提供しているSmartHRのデザインシステムの立ち上げ前から、現在までの取り組みをケースとして扱いながら、デザインシステムの構想・構築・運用について、一般論を含めて解説します。まずはなにもわからなくても大丈夫。デザインシステムを始める目的と、最初に手をつけるべきコンテンツを考えるところからスタートしましょう。",
        "categories": [
            "Language Arts & Disciplines"
        ]
    },
    {
        "isbn": "9784492047200",
        "title": "Ｃｈａｔｔｅｒ（チャッター）",
        "authors": [
            "イーサン・クロス"
        ],
        "description": "集中力や判断力をなくす「チャッター」を制御し、「内なる批判者」を「最強のコーチ」に変える。科学に基づく最強のテクニック。",
        "categories": [
            "Business & Economics"
        ]
    },
    {
        "isbn": "9784299043009",
        "title": "ChatGPT 120%活用術",
        "authors": [
            "ChatGPTビジネス研究会"
        ],
        "description": "いま世界中で話題の対話型AIチャットボット「ChatGPT」を仕事でもプライベートでも使い倒すための解説書です。質問を入力するとAIが回答してくれるイメージが強いChatGPTですが、エクセルと組み合わせた表計算から、マーケティングリサーチ、ブログ記事の作成など、その使い方は豊富。本書は、PCやスマホからの登録方法を丁寧に解説するところから始まり、ChatGPTでできる多くの利用アイデアを徹底解説する入門書の決定版です。",
        "categories": null
    },
    {
        "isbn": "9784297132347",
        "title": "ちょうぜつソフトウェア設計入門――PHPで理解するオブジェクト指向の活用",
        "authors": [
            "田中ひさてる"
        ],
        "description": "SoftwareDesign誌での連載と技術アドベントカレンダー24回ぶんに収まらなかった関連知識を徹底解説。いわゆる「オブジェクト指向」と呼ばれる考え方から発展した分野は、どのようにソフトウェア設計の役に立つのかを、よく知られた原則、テスト駆動開発、デザインパターンなどを通じて理解できる一冊です。上級者には定番の知識を体系的に整理するヒントとして、初級者には可愛いイラストで覚えるキーワード集として、幅広く活用していくことができます。なお、サンプルコードはPHPで書かれていますが、他の言語に置き換えて読めるコードばかりです。PHPを使っているかどうかを問わず、全ての開発者にオススメです。",
        "categories": null
    },
    {
        "isbn": "9784297130664",
        "title": "作って学べる Unity本格入門 [Unity 2022対応版]",
        "authors": [
            "賀好昭仁"
        ],
        "description": "本書はUnityでゲーム開発を行いたい人を対象に、1つのゲームを制作する流れを通してUnity 2022の操作が学べる入門解説本です。本書内で武器などを調達し、食べ物を求めながら冒険し、武器でモンスターと戦う3Dアクションゲームを制作していきます。本格的なゲームを実際に制作しながらUnityの使い方を学べますので、楽しみながら学びことができ、かつ実践的なテクニックも身につけることができます。",
        "categories": null
    },
    {
        "isbn": "9784478116739",
        "title": "Deep Skill ディープ・スキル",
        "authors": [
            "石川明"
        ],
        "description": "4000人を観察してわかった!組織と人を巧みに動かすビジネスパーソンが実践している、深くてさりげない「25の技術」",
        "categories": null
    },
    {
        "isbn": "9784478117743",
        "title": "とにかく仕組み化",
        "authors": [
            "安藤広大"
        ],
        "description": "3千社以上が導入したマネジメント法・識学。「とにかく仕組み化」という考えを元に、ルールによって問題解決をする方法を伝授。",
        "categories": null
    },
    {
        "isbn": "9784296000982",
        "title": "NUDGE 実践行動経済学完全版",
        "authors": [
            "リチャード・セイラー",
            "キャス・サンスティーン"
        ],
        "description": "全米ベストセラー! ノーベル賞受賞の経済学者が、もっともわかりやすく、一般向けに書いた、「使える経済学」の決定版。",
        "categories": null
    },
    {
        "isbn": "9784799111208",
        "title": "何歳からでも結果が出る本当の勉強法",
        "authors": [
            "望月俊孝"
        ],
        "description": "★著者が30年間でおよそ１億7000万円を費やして世界中のエキスパートから学んだ学習心理学、行動経済学の知見を織り込んだ集大成★ ★全項目に必ず近年発表、世界中の研究機関の論文などのエビデンス入り★ ★見出しはすべて○×形式、明快に結論を教えてくれる★ 「偏差値を上げたい」「点数を上げたい」「とにかく合格したい」……勉強本としてそんな想いに120％応え、ストレートにその方法を伝授。さらに人間が持つ知性の可能性を見つめ、人生を豊かにし、楽しく情熱にあふれたものにアップグレードするコツが1冊で身につきます。 数ある「インプット本」の決定版を目指したのが本書です。 「受験勉強に挑んでいる現役の学生の方」 「勉強に悩むお子さんを持つ親御さん」 「キャリアアップの学びに励むビジネスパーソンの方」 「学校や塾の先生方、企業や公益団体で教育にあたる立場の方」 「還暦を迎えたあとも自分の可能性を追求したい方」 「記憶力をはじめ、自分の能力をもっと評価されたい方」 「『久しぶりに何かを学ぼうかな』と思いはじめた方」……そんなすべての人へ！ 【株式会社すばる舎】",
        "categories": [
            "Self-Help"
        ]
    },
    {
        "isbn": "9784163911380",
        "title": "2050年世界人口大減少",
        "authors": [
            "ダリル・ブリッカー",
            "ジョン・イビットソン"
        ],
        "description": "名門調査会社が明かす、震撼の未来。経済、SDGs、生き方も激変。救世主は女性か、移民か、AIか。悩む日本への処方箋つき。",
        "categories": null
    },
    {
        "isbn": "9784814400218",
        "title": "入門モダンLinux",
        "authors": [
            "Michael Hausenblas"
        ],
        "description": "Linuxの最新動向が知りたい、より効率的に開発を行い、知識を体系的に整理したい中上級者向け。押さえておくべき内容をカバー。",
        "categories": null
    },
    {
        "isbn": "9784798174990",
        "title": "Python2年生 デスクトップアプリ開発のしくみ 体験してわかる！会話でまなべる！",
        "authors": [
            "森 巧尚"
        ],
        "description": "Pythonで デスクトップアプリ開発を 体験してみよう！ 【初心者でもできる！デスクトップアプリ開発を一緒に体験しよう】 Pythonの基礎知識はあるけど、 「アプリ開発って初心者には難しそう」 「プログラムで何か残るものを作ってみたい」 と思っていませんか？ 本書はそうした方に向けて、初心者にも簡単に作れる方法を使ってデスクトップアプリ開発の基本をやさしく解説します。スマホアプリ、Webアプリに比べて、手軽に取り組めますので挫折することなく学習できます。本書を読んだあとは、スマホアプリやWebアプリ開発に挑戦してみてください。 【Python2年生について】 「Python2年生」は、「Python1年生」を読み終えた方を対象とした入門書です。ある程度、技術的なことを盛り込み、本書で扱う技術について身につけてもらいます。 『Python2年生 スクレイピングのしくみ』（ISBN：9784798161914） 『Python2年生 データ分析のしくみ』（ISBN：9784798164960） も刊行されています。 【対象読者】 デスクトップアプリの作り方を知りたい初心者 【本書のポイント】 ヤギ博士＆フタバちゃんと一緒に、デスクトップアプリ開発の考え方から丁寧に解説。デスクトップアプリ開発をする時に必要な前提知識からはじまり、デスクトップアプリ作りの基本、応用的なデスクトップアプリ、そしてゲームアプリ開発まで解説します。 【著者プロフィール】 森 巧尚（もり・よしなお） アプリの開発や、技術書や電子工作マガジンなどでの執筆活動。関西学院大学非常勤講師、関西学院高等部非常勤講師、成安造形大学非常勤講師、プログラミングスクールコプリ講師など、プログラミングに関する幅広い活動を行っている。近著に、『Python1年生 第2版』、『Python3年生機械学習のしくみ』、『Python2年生 スクレイピングのしくみ』、『Python2年生 データ分析のしくみ』、『Java1年生』、『動かして学ぶ！Vue.js開発入門』（いずれも翔泳社）、『楽しく学ぶ アルゴリズムとプログラミングの図鑑』（マイナビ出版）などがある。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784798176611",
        "title": "Pythonによるあたらしいデータ分析の教科書 第2版",
        "authors": [
            "寺田 学",
            "辻 真吾",
            "鈴木 たかのり",
            "福島 真太朗"
        ],
        "description": "読者の声に応えて第2版の登場！ データ分析エンジニアに必要な 基本技術をしっかり習得できる 【本書の概要】 本書はデータ分析エンジニアに必要な 以下の基礎技術を丁寧に解説しています。 ・データの取得・加工 ・データの可視化 ・プログラミング ・基礎的な数学の知識 ・機械学習の流れや実行方法 【第2版のポイント】 ・Python 3.10対応 ・よりわかりやすい解説 ・Pythonデータ分析試験の主教材に指定 【本書で学べること】 ・Pythonの基本的な文法 ・データフォーマットについて ・データの前処理技術 ・データの可視化技術 ・既存アルゴリズムでの機械学習の実装方法 【対象読者】 データ分析エンジニアを目指す方 【目次】 第1章 データ分析エンジニアの役割 第2章 Pythonと環境 第3章 数学の基礎 第4章 ライブラリによる分析の実践 第5章 応用：データ収集と加工",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784802613934",
        "title": "Python+JSON データ活用の奥義",
        "authors": [
            "クジラ飛行机"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784296201600",
        "title": "Pythonライブラリの教科書",
        "authors": [
            "立山秀利"
        ],
        "description": "ライブラリを活用して、どのようなことができるのかを体験する入門者向けの本です。",
        "categories": null
    },
    {
        "isbn": "9784296001576",
        "title": "ハッキング思考強者はいかにしてルールを歪めるのか、それを正すにはどうしたらいいのか",
        "authors": [
            "ブルース・シュナイアー"
        ],
        "description": "AI時代にルールを味方につけるには、「正しいハッキングの考え方」が必要だ。",
        "categories": null
    },
    {
        "isbn": "9784478117118",
        "title": "半導体産業のすべて",
        "authors": [
            "菊地正典"
        ],
        "description": "開発・製造・販売のキープレイヤーとその相関関係を詳細に解説。全産業の基礎装置、戦略物資である半導体のすべてがこの1冊に。",
        "categories": null
    },
    {
        "isbn": "9784478115466",
        "title": "半導体戦争",
        "authors": [
            "クリス・ミラー"
        ],
        "description": "国家の命運は、「計算能力」をどう活かせるかにかかっている。技術の仕組みから国家間の思惑まで網羅的に解説。日本復活の目は?",
        "categories": null
    },
    {
        "isbn": "9784798177649",
        "title": "ビジネスダッシュボード 設計・実装ガイドブック 成果を生み出すデータと分析のデザイン",
        "authors": [
            "トレジャーデータ",
            "池田 俊介",
            "藤井 温子",
            "櫻井 将允",
            "花岡 明"
        ],
        "description": "課題解決や意思決定に貢献し、活用されるダッシュボードとは? 本書では、CDPのトップ企業であるトレジャーデータのプロフェッショナルサービスチームが培ったノウハウをもとに、ビジネスに貢献できるダッシュボードの設計、実装から運用方法までを具体的に説明しています。 DXやデータドリブン、データ活用といった言葉が浸透し、BIツールが普及した結果、多くの企業がダッシュボードを利用するようになりました。 しかし、「必要な指標やデータが入っていない」「グラフや表が多すぎて使いづらい」といった声も聞かれます。そうしたダッシュボードは、もしやBIツールが使えるから、データ分析ができるからと自己流で作ったものではありませんか? 多くのチャートが並び、どれだけ見た目が良くても、使われないダッシュボードはビジネスに貢献できません。また、データに不備があるものや重要なポイントが可視化されていないものは、ミスリードの原因にもなりかねません。 役に立つダッシュボードとするには、システム開発と同様に要求定義・要件定義、設計、実装、レビューといったプロセスが必要で重要です。ユーザーにヒアリングし、何が課題なのか、何が必要なのかを探るところから始めます。 本書を活用すれば自己流を卒業し、ダッシュボードをより効果的に活用できるようになるでしょう。特定のBIツールやデータ基盤に依存しない内容なので、データ活用プロジェクトやダッシュボード構築プロジェクトに携わる、全ての人におススメの1冊です。 【こんな方におススメします！】 ビジネスダッシュボードにかかわる ・ダッシュボード作成担当者 ・プロジェクトリーダーやDX担当者 ・BIツールユーザー ・システムエンジニア、データエンジニア 【目次】 第1章 ダッシュボードの種類と課題 第2章 ダッシュボード構築プロジェクトの全体像 第3章 ダッシュボードの要求定義・要件定義 第4章 ダッシュボード設計 第5章 ダッシュボードデザイン 第6章 データ準備・ダッシュボード構築 第7章 運用・レビュー・サポート 付録",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784297133146",
        "title": "評価指標入門〜データサイエンスとビジネスをつなぐ架け橋",
        "authors": [
            "高柳慎一",
            "長田怜士"
        ],
        "description": "「評価指標でXXXという最高のスコアが出た!」と喜び勇んで、機械学習モデルが出力してくる予測結果をもとにビジネスを運用したとします。 ところが、ビジネス上のKPIと相関が高い評価指標を選んでいなかったために、KPIの推移を見てみると大した変化がありませんでした。 あるいは「毎日夜遅くまで残業をして、特徴量生成とクロスバリデーションによって評価指標を改善しました!」というデータサイエンティストがいたとします。ところが、KPIの改善のためにはそこまで高い評価指標の値を達成する必要ありませんでした。このようなケースでは、データサイエンティストが費やした工数がすべて水の泡となってしまいます。----------(はじめにより)---------- このような状況が起きてしまう背景にはさまざまな原因が考えられますが、あえて一言で言うと「データサイエンスの問題が解くべきビジネスの問題と乖離していた」ためです。 機械学習モデルの”良し悪し”を決めるときには、評価指標(Evaluation Metrics)を必要とします。本質的に評価指標の設計方法は自由であり、ビジネス上の価値を考慮して自ら作成することも可能です。RMSEやAUCといったスタンダードなものから、ドメインに特化した数値まで、あらゆる指標が評価指標になりえます。では評価指標はどのように決めるのが良いのでしょうか。また、どのように決めれば冒頭のような悲しい状況を生まずに済むのでしょうか。 本書はこれらの疑問に答えるため、機械学習の良し悪しを決める評価指標を軸に、解くべきビジネスの問題をどうやってデータサイエンスの問題に落とし込むのか、その原理を解説していきます。この原理が普遍的なものであれば、ビジネスがどんなものであっても応用できると考えることができます。 回帰、分類で使用するスタンダードな評価指標についても、基本から丁寧に解説します。本書を読むことで、どのようなケースでどの評価指標を選ぶべきかがわかり、評価指標の読み間違いを避けることができます。",
        "categories": null
    },
    {
        "isbn": "9784408650043",
        "title": "ファンダメンタルズ×テクニカルマーケティング",
        "authors": [
            "木下勝寿"
        ],
        "description": "「29%」という驚異の利益率を誇る「北の達人」。同社の根幹にある不変的で精緻なマーケティング理論の全てをここに公開する。",
        "categories": null
    },
    {
        "isbn": "9784761276362",
        "title": "付加価値のつくりかた",
        "authors": [
            "田尻望"
        ],
        "description": "キーエンス出身の著者が仕事の悩みをすべて解決する「付加価値のノウハウ」を体系化。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784798068534",
        "title": "プログラマー脳 ~優れたプログラマーになるための認知科学に基づくアプローチ",
        "authors": [
            "フェリエンヌヘルマンス"
        ],
        "description": "プログラマーが知っておくべき認知科学のこと。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784908686160",
        "title": "プログラマーのためのCPU入門",
        "authors": [
            "タケノブ・タニ"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784814400225",
        "title": "プログラミング文体練習",
        "authors": [
            "Cristina Videira Lopes"
        ],
        "description": "1課題を40のプログラミングスタイルで実装するコンセプトで、プログラムの書き方とさまざまなアルゴリズムの長所短所を解説。",
        "categories": null
    },
    {
        "isbn": "9784798177410",
        "title": "プロジェクトマネジメントの基本が全部わかる本 交渉・タスクマネジメント・計画立案から見積り・契約・要件定義・設計・テスト・保守改善まで",
        "authors": [
            "橋本 将功"
        ],
        "description": "新規事業・DXを成功に導く 普遍的なPMスキルを習得しよう チームで仕事をするには欠かせないプロジェクトマネジメント（PM）。 一般的なビジネススキルであるにもかかわらず、 多くの人が我流で進めた結果、数々の失敗を経験しています。 その理由は、基本を正しくおさえられていないからです。 そこで本書では、 なにを対象としたどのような規模のものであっても活用できる PMの基本スキルを丁寧に解説します。 プロジェクトマネージャー一筋22年の著者・橋本将功が これまで経験した失敗から学び得た全知見を注ぎ込み、体系化しました。 B to C・B to Bの両業態から、ITプロジェクトをはじめとしたさまざまな業種まで、 PMスキルを大幅に底上げする知識と実践方法が惜しみなく公開されています。 とくに ・新規事業やDXに携わるマネージャー ・受託プロジェクトのマネージャー ・PMの基本を学び直したいビジネスパーソン ・プロダクト開発に挑戦するスタートアップの経営者、エンジニア、デザイナー にとっては必読の一冊でしょう。 ●目次概要 序章 プロジェクトマネジメントのスキルの全体像 第1章 プロジェクトとはなにか―基本的な知識と考え方をおさえよう 第2章 交渉―適切なパートナーシップを築こう 第3章 タスクマネジメント―チームでパスワークをしよう 第4章 プロジェクト計画―目標や進め方を決めよう 第5章 見積り―必要な費用とスケジュールを構想しよう 第6章 契約―不利な条件を回避しよう 第7章 要件定義―やるべきことを決めよう 第8章 デザイン―顧客が本当に必要だったものを目指そう 第9章 設計―専門家に渡すバトンをつくろう 第10章 テスト―事業リスクを最小限におさえよう 第11章 リリース―石橋を叩いて渡ろう 第12章 保守改善―事業の成功につなげよう ※現在、在庫切れのため出荷までお時間をいただきます。 出荷予定日は2023年1/10（火）です。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784814400430",
        "title": "プロダクトマネージャーのしごと第2版",
        "authors": [
            "Matt LeMay"
        ],
        "description": "プロダクトマネジメントの考え方と行動について解説! プロダクトマネジメントは理論的には人々に愛されるプロダクトを作ることであり、ビジネスゴールとユーザニーズを計測することとされていますが、実際は、問題に直面しているプロダクトを改良するための粘り強い取り組みであり、ビジネスの「ゴール」が何かを明らかにするために執拗に働きかけることです。プロダクトマネジメントにおけるあいまいさや矛盾、不本意な妥協を紹介し、プロダクトマネージャーに必要な考え方と日々の行動、過ごし方を解説します。",
        "categories": null
    },
    {
        "isbn": "9784798169477",
        "title": "フロントエンド開発のためのセキュリティ入門 知らなかったでは済まされない脆弱性対策の必須知識",
        "authors": [
            "平野 昌士"
        ],
        "description": "Webアプリケーションの堅牢化に欠かせない知識を凝縮！ セキュリティ学習のスタートに最適の一冊！ 本書は、安全なWebアプリケーションを開発するための基本知識を、フロントエンドエンジニア向けに解説したセキュリティの入門書です。 これまでWebアプリケーションの開発で、セキュリティは「バックエンドの仕事」というイメージの強い領域でした。しかし、アプリケーションの安全性を高めるためには、フロントエンドエンジニアにも、セキュリティの基礎知識や具体的な対策の実践が求められます。 本書では、Webセキュリティの必須知識である「HTTP」「オリジン」などの基礎トピックや、「XSS」「CSRF」といったフロントエンドを狙ったサイバー攻撃の仕組みを、サンプルアプリケーションを舞台にしたハンズオンで学びます。 もちろん、攻撃からユーザーを守る防御の手法もしっかりおさえます。個々の攻撃手法に応じた対策のほか、「認証機能の実装」「JavaScriptライブラリの安全な使い方」など、開発現場で役立つ実践的な脆弱性対策もカバーしているので、自分の開発で取り入れられるセキュリティ向上のヒントが多く見つかるはずです。 ■目次 第1章 Webセキュリティ概要 第2章 本書のハンズオンの準備 第3章 HTTP 第4章 オリジンによるWebアプリケーション間のアクセス制限 第5章 XSS 第6章 その他の受動的攻撃（CSRF、クリックジャッキング、オープンリダイレクト） 第7章 認証・認可 第8章 ライブラリを狙ったセキュリティリスク Appendix 本編では扱わなかったトピックの学習 【著者】 ●平野 昌士 サイボウズ株式会社 フロントエンドエンジニア JSConf JPスタッフや関西Node学園といったコミュニティの運営を行う傍ら、OSS活動にも取り組んでおり、Node.js Core Collaborator（コミッター）に選出されている。WebとJavaScriptが好きでブログや雑誌の記事執筆、イベントでの講演など多数。 【監修】 ●はせがわ ようすけ 株式会社セキュアスカイ・テクノロジー 取締役CTO Internet Explorer、Mozilla FirefoxをはじめWebアプリケーションに関する多数の脆弱性を発見。 Black Hat Japan 2008、韓国POC 2008、2010、OWASP AppSec APAC 2014、CODE BLUE 2016他講演多数。 ●後藤つぐみ 株式会社セキュアスカイ・テクノロジー セキュリティエンジニア 脆弱性診断業務に従事する傍らで、同社内の脆弱性診断員に向けた業務マニュアルの作成およびレビューをリードする。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784296000777",
        "title": "冒険の書 AI時代のアンラーニング",
        "authors": [
            "孫泰蔵"
        ],
        "description": "起業家、孫泰蔵氏が書き下ろした渾身の一冊。14歳から親、ビジネスパーソンまでがとらわれている「学び」にまつわる探求の旅。",
        "categories": null
    },
    {
        "isbn": "9784798068039",
        "title": "見てわかるUnrealEngine5超入門",
        "authors": [
            "掌田津耶乃"
        ],
        "description": "未経験者でも大丈夫!何をしたらいいのかわからない人へ、手を動かして覚えるUE5の使い方。Windows/macOS対応。ハンズオンの解説で手順全部のせ!",
        "categories": null
    },
    {
        "isbn": "9784799110881",
        "title": "リーダーは話し方が９割",
        "authors": [
            "永松茂久"
        ],
        "description": "リーダーよ、話し方で悩むのはこれで終わりにしよう！――「大勢の前で話すのが苦手」「朝礼のときが憂鬱……」「リーダーシップをとってコミュニケーションを取るのは緊張する」というリーダーは多いものです。 でも、ちょっぴり、リーダーとしての「話し方のコツ」を押さえるだけで、部下・後輩・メンバーとのコミュニケーションが楽しくなり、リーダーとしてもうまくいくようになり、まわりから好かれ、尊敬されるようになります。 リーダーとしてのコミュニケーション力を磨けば、自分も部下・後輩・メンバーも安心できるチームをつくることができ、大勢の前で話すことがラクになり、仕事も人間関係も人生も、全部がよりよい方向に好転していきます！ 上司、管理職、店長、親、先生、先輩、キャプテン、幹事――どんなリーダーにも役立ちます！",
        "categories": [
            "Self-Help"
        ]
    },
    {
        "isbn": "9784492534601",
        "title": "リデザイン・ワーク　新しい働き方",
        "authors": [
            "リンダ・グラットン"
        ],
        "description": "「人生１００年時代」のリンダ・グラットンが描く「仕事のあり方」「働く意味」「人生の豊かさ」の“リデザイン（再設計）”。",
        "categories": [
            "Business & Economics"
        ]
    },
    {
        "isbn": "9784777519699",
        "title": "はじめてのSpringBoot",
        "authors": [
            "槙俊明"
        ],
        "description": "大幅バージョンアップに合わせて全面改訂!PaaS「Cloud Foundry」の使い方も追加!新世代「Javaフレームワーク」",
        "categories": null
    },
    {
        "isbn": "9784802611855",
        "title": "現場至上主義 Spring Boot2徹底活用",
        "authors": [
            "廣末丈士",
            "宮林岳洋"
        ],
        "description": "超実践、高速開発フレームワーク解説書。Doma2によるデータアクセスの最適化からThymeleafによる画面開発の効率化、Spring Securityによる高機能セキュリティ、Dockerを活用したチーム開発、Spring Profilesによる運用の最適化まで、いますぐ知り、使いたい現場の生の技術を、密に凝縮。JDK8/11両対応。",
        "categories": null
    },
    {
        "isbn": "9784297126353",
        "title": "ゼロからわかる TypeScript入門",
        "authors": [
            "WINGSプロジェクト齊藤新三"
        ],
        "description": "Webアプリケーション開発をもっと「安全」に! 「型」を駆使したTypeScriptプログラミングをしっかり学ぼう! TypeScript は、JavaScript にクラスや静的型付けなどの機能を加えた「altJS」の1つですが、近年、Web アプリケーションフレームワークの標準言語としての採用が増加し、Web開発の必修言語として需要が急速に伸びています。本書は、プログラミング初心者や本職プログラマーではない方を対象に、TypeScriptの基本的な文法とプログラミング方法をていねい&しっかり解説しています。また、最終章でWeb API とJSON を利用した非同期Web アプリケーションの作成方法を解説しているので、Web開発で役立つ活用テクニックも短時間ですばやく学習できます。",
        "categories": null
    },
    {
        "isbn": "9784297127473",
        "title": "プロを目指す人のためのTypeScript入門安全なコードの書き方から高度な型の使い方まで",
        "authors": [
            "鈴木僚太"
        ],
        "description": "TypeScriptは、JavaScriptに静的型付けの機能を加えたオープンソースのプログラミング言語です。本書では、根幹となるJavaScriptの仕様・機能とともに、TypeScript独自の仕様・機能を解説します。TypeScriptの基礎知識はこれ一冊だけで学べます。 静的型付き言語は世にいくつもありますが、TypeScriptの型システムは他に類を見ない高い表現力を持っています。本書の読者が、型の有効性を理解しTypeScriptらしいコードを書けるようになるために、本書では、プログラムの安全性を高める基本的な型の扱い方から、TypeScriptの「高い表現力」の源となっているリテラル型・ユニオン型・keyof 型の扱い方まで幅広く取り上げます。また、わかりにくい機能や型安全を脅かす危険な機能についてもごまかさず、歴史的経緯や目的・用途を踏まえたうえで最善の扱い方を説明します。 章ごとに力試し問題を用意しており、理解の度合いを確認しながら学習を進められます。",
        "categories": null
    },
    {
        "isbn": "9784822298975",
        "title": "TypeScript実践マスター",
        "authors": [
            "古賀慎一"
        ],
        "description": "データ型、オブジェクト指向プログラミング、制御文、配列、非同期処理、ジェネリック、etc.TypeScriptの仕様から使い方までわかりやすく解説!",
        "categories": null
    },
    {
        "isbn": "9784863543553",
        "title": "手を動かしながら学ぶTypeScript",
        "authors": [
            "渡邉比呂樹",
            "鴇田将克",
            "森本新之助"
        ],
        "description": "本書はJavaScriptの経験がある人向けのTypeScriptの入門書です。",
        "categories": null
    },
    {
        "isbn": "9784297129163",
        "title": "TypeScriptとReact/Next.jsでつくる実践Webアプリケーション開発",
        "authors": [
            "手島拓也",
            "吉田健人",
            "高林佳稀"
        ],
        "description": "新しいフロントエンドの入門書決定版! 本書はReact/Next.jsとTypeScriptを用いてWebアプリケーションを開発する入門書です。 WebアプリケーションフレームワークNext.jsはReactをベースに開発されています。 高速さに裏付けされた高いUXと、開発しやすさを両立しているのが特徴です。 本書では、Next.jsの開発をより快適・堅牢にするTypeScriptで開発を進めます。 Next.jsによるアプリケーション開発の基礎、最新のフロントエンドやWebアプリケーションの開発方法が学べます。",
        "categories": null
    },
    {
        "isbn": "9784863543324",
        "title": "Vue.jsビギナーズガイド 3.x対応",
        "authors": [
            "ushironoko"
        ],
        "description": "Vue.js3.0の入門に最適!",
        "categories": null
    },
    {
        "isbn": "9784863543522",
        "title": "現場で使えるVue.js 3.X 実践ガイド",
        "authors": [
            "MONSTER DIVE"
        ],
        "description": "Vue.jsの実践が学べる1冊!",
        "categories": null
    },
    {
        "isbn": "9784297130725",
        "title": "Vue 3 フロントエンド開発の教科書",
        "authors": [
            "WINGSプロジェクト齊藤新三"
        ],
        "description": "人気のWebフロントエンドフレームワーク「Vue.js」がバージョンアップして「Vue 3」となり、TypeScriptの標準採用、新機能Composition API、Vite、Piniaの搭載など、大幅に機能が更新・強化されました。それに伴い、Vue 3では、従来のOptions APIを利用したコンポーネント開発とは異なる開発手法が必要となります。本書では、Composition APIによるコンポーネント開発やPiniaによる状態管理、Vue RouterによるSPA開発、非同期処理やユニットテストなどを新機能を駆使して解説しており、Vue 3によるフロントエンド開発手法が1冊ですべて身に付く内容になっています。",
        "categories": null
    },
    {
        "isbn": "9784798158921",
        "title": "動かして学ぶ！Vue.js開発入門",
        "authors": [
            "森巧尚"
        ],
        "description": "【Vue.js（ビュージェイエス）とは】 Vue.jsは、Webアプリ開発用のJavaScriptフレームワークです。 比較的小規模の開発から利用でき、さらにWebアプリ開発で主流になりつつある、 シングルページアプリケーション（SPA）を構築することもできるため、 Web開発で大人気のフレームワークです。 【本書の概要】 Vue.jsの基本機能を押さえたサンプルを元に、Webアプリ開発手法を学ぶことができます。 具体的には、ニーズの高い、データバインディング、イベント、ライブラリの利用、コンポーネントなど 開発の現場でニーズの高いトピックを中心に解説。 さらに現在、主流になりつつあるSPAの作成に役立つポイントも盛り込みます。 【ターゲット】 フロントエンドエンジニア初心者 【著者】 森巧尚（もり・よしなお） この世にパソコンが誕生したばかりの時代からミニゲームを作り続けて30数年。 現在は、iPhoneアプリやFlash、HTML5などのオリジナルゲームのコンテンツ制作、執筆活動、 関西学院大学非常勤講師などを行う。 最近は、IchigoJamで小学生向けのプログラミングを行うPCN大阪やCoder Dojoなどでも活動している。 著書：『Python1年生』『Java1年生』（翔泳社）、『小学生でもわかるiPhoneアプリの作り方』（秀和システム）、 『SwiftではじめるiPhoneアプリ開発の教科書』（マイナビ）『iPhoneのゲームアプリをつくろう！』（秀和システム） 『よくわかるiPhoneアプリ開発の教科書』（マイナビ）など、多数。",
        "categories": null
    },
    {
        "isbn": "9784844398356",
        "title": "Vue.jsとFirebaseで作るミニWebサービス",
        "authors": null,
        "description": null,
        "categories": null
    }
]