[
    {
        "isbn": "9784798136578",
        "title": "スラスラわかるC++",
        "authors": [
            "矢沢久雄"
        ],
        "description": "ベストセラー著者による C++入門書の新定番 プログラミング言語C++は、ゲームプログラムなど高度・高速な処理を求められる分野で幅広く利用されているポピュラーな言語のひとつです。本書は「プログラミングの知識ゼロ」という状態から、プログラミングの基礎知識や作法、言語の基本構文、基本テクニックなどを無理なく習得し、プログラムを自力で作れるようになるところまでをしっかりとフォローします。 数多くのベストセラーがあり、Webメディアや新人研修でも活躍している矢沢久雄氏を著者に迎え、プログラミングの楽しさを実感できる紙面構成を目指しました。他の入門書で挫折した方やプログラミングに苦手意識を持っている方にもおすすめできる一冊です。 ※本電子書籍は同名出版物を底本とし作成しました。記載内容は印刷出版当時のものです。 ※印刷出版再現のため電子書籍としては不要な情報を含んでいる場合があります。 ※印刷出版とは異なる表記・表現の場合があります。予めご了承ください。 ※プレビューにてお手持ちの電子端末での表示状態をご確認の上、商品をお買い求めください。 (翔泳社)",
        "categories": [
            "Technology & Engineering"
        ]
    },
    {
        "isbn": "9784797377026",
        "title": "新・明解C言語 入門編",
        "authors": [
            "柴田望洋"
        ],
        "description": "超ベスト＆超ロングセラーの大改訂版 ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 日本で最も多くの読者を獲得しているC言語入門書の大改訂版、ここに誕生。適切なサンプルプログラムと図表を使って、一つ一つのステップを着実に進めていく、語り口調の解説により、C言語の基礎を確実にマスターできます。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784797397161",
        "title": "新・明解C++で学ぶオブジェクト指向プログラミング",
        "authors": [
            "柴田望洋"
        ],
        "description": "『新・明解C++入門』の姉妹編、ここに刊行 ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 C++を用いてオブジェクト指向プログラミングの基礎を学習するための入門書です。 まずは、クラスの基礎から学習を始めます。データと、それを扱う手続きとをまとめることによってクラスを作成します。それから、派生・継承、仮想関数、抽象クラス、例外処理、クラステンプレートなどを学習し、オブジェクト指向プログラミングの核心へと話が進んでいきます。その過程で、C++という言語の本質と、オブジェクト指向プログラミングに対する理解を深めていきます。最後の三つの章では、ベクトル、文字列、入出力ストリームといった、重要かつ基本的なライブラリについて学習します。 本書を通して、読者は、C++という言語の本質と、オブジェクト指向プログラミングに対する理解を深めることができるでしょう。 なお、本書は、『新・明解C++入門』（2017年12月刊行）の姉妹編であり、『新・明解C++入門』でC++の基礎を学んだ読者にとって最適なテキストです。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784798054278",
        "title": "現場ですぐに使える!C/C++逆引き大全560の極意",
        "authors": [
            "増田智明"
        ],
        "description": "基礎から便利技までコーディングテクニックが満載!そのまま流用できる豊富なサンプルプログラム!アプリケーション開発に必要な知識をコンパクトに解説!27の分類で目的のクラス、メソッドがすぐに探せる!",
        "categories": null
    },
    {
        "isbn": "9784774161839",
        "title": "iPhone／iPad開発ポケットリファレンス",
        "authors": [
            "WINGSプロジェクト",
            "片渕彼富"
        ],
        "description": null,
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784873110639",
        "title": "C++プログラミング入門",
        "authors": [
            "グレゴリー サティア",
            "ダウグブラウン"
        ],
        "description": "本書は、1996年の発行以来、C++言語の定番書となった書物の新版である。新版の発行にあたり、古くなった情報を見直し、加筆/修正した。CプログラマがC++言語を修得することを念頭におき構成し、つまずきやすい落とし穴やプログラミングのコツを数多く掲載し、C++の基礎をわかりやすく解説。C++プログラミングの基礎を確実かつ素早く習得するための必読の書。また、セミナーや講習等の教材としても好適。",
        "categories": [
            "Reference"
        ]
    },
    {
        "isbn": "9784810180473",
        "title": "プログラミング言語C++",
        "authors": [
            "Bjarne Stroustrup",
            "信男·斎藤"
        ],
        "description": null,
        "categories": null
    }
]