[
    {
        "isbn": "9784295007807",
        "title": "スッキリわかるJava入門 第3版",
        "authors": [
            "中山 清喬",
            "国本 大悟",
            "株式会社フレアリンク"
        ],
        "description": "発売から8年であっという間に総計40万部到達した大人気シリーズの原点。 「どうして？」「なぜそうなる？」が必ずわかるJava入門書史上最強の定番書の増補改訂版登場！ 従来の入門書は、先生が生徒が一方的に話し続けるようなスタイルで構成されているモノが多く、それらは途中初学者が思い浮かべる「なぜ？」「どうして？」を置き去りにしたまま次の解説に移っていくため、理解が進まず多くの挫折を生み出してきました。 本書は、初学者がよくつまずくポイントや疑問点に対して、いろいろな角度から具体的なアドバイスを行っているため、まだ腑に落ちていないのに勝手にストーリーが進むということがなく、一歩一歩着実に理解を深めて、無駄なく短期間で知識を習得できる構成になっています。 また、主人公の新人エンジニア湊君が、仲間や先輩とのやりとりの中で徐々に成長していくストーリーを傍らに学んでいくので、飽きることなく楽しくJavaが身に付く仕掛けになっています。 プログラミング入門者のネックとなる「開発環境の準備」には、仮想開発環境「dokojava」を読者特典として用意。 「多発するエラーへの対応」にはFAQ集「エラー解決・虎の巻」が付いていますので、安心して学習を進められます。 第3版では、Java11を基準に内容を改訂し、実務で頻用するコレクションなどの解説を新たに取り込みました。また、好評の仮想開発環境「dokoJava」をブラッシュアップして使い勝手を高めたほか、紙面上の主要ソースコードにQRコードを配し、より学習しやすくなるよう細部に工夫を加えています。 本書でぜひ、Javaプロフェッショナルへの第一歩を踏みだしてください！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784797355727",
        "title": "やさしいJava",
        "authors": [
            "高橋麻奈"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784295008552",
        "title": "スラスラ読める Javaふりがなプログラミング",
        "authors": [
            "谷本 心",
            "リブロワークス"
        ],
        "description": "「プログラムの読み方をすべて載せる（ふりがなをふる）」 という手法で究極のやさしさを目指した、 まったく新しいJava（ジャバ）の入門書です。 本書内に登場するプログラムの読み方をすべて載せ、 さらに、漢文訓読の手法を取り入れ、読み下し文を用意。 プログラムの1行1行が何を意味していて、 どう動くのかが理解できます。 この新しいアプローチで「自分がいま何をしているのかわからない」といった プログラミング入門者が途中で挫折してしまう原因を解決しました。 また、実際に手を動かしながら進むだけでなく、 プログラムを考える応用問題も用意しているため、 しっかりJavaの基礎文法を身につけることができます。 ■本書はこんな人におすすめ ・Javaの基礎を身につけたい人 ・過去にJavaの入門書で挫折してしまった人 ・プログラマーやエンジニアを目指す人 ・仕事でJavaを活用してみたい人 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784815606015",
        "title": "新・明解Java入門　第２版",
        "authors": [
            "柴田望洋"
        ],
        "description": "Java入門書の最高峰！！ ※この電子書籍は固定レイアウト型で配信されております。固定レイアウト型は文字だけを拡大することや、文字列のハイライト、検索、辞書の参照、引用などの機能が使用できません。 シリーズ累計120万部突破！！ 「Java入門書の最高峰」と多くの読者から絶賛された前著（2016年刊行）の改訂版です。 たくさんの図表とサンプルプログラムを使って、Javaの基礎から、オブジェクト指向プログラミングの本質までをわかりやすく解き明かします。 今回の改訂にあたっては、最新のJavaに対応させるとともに、文章とレイアウトを全面的に見直し、一段と読みやすく、理解しやすい内容になっています。 初めてプログラミングを学ぶ人、他の入門書ではマスターできなかった人、本当にJavaをマスターしたい人など、Javaに関心をもつすべての読者にとって、最良の1冊です。",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784774171319",
        "title": "ゼロからわかるJava超入門",
        "authors": [
            "佐々木整"
        ],
        "description": "プログラミングの経験がなくても、この1冊でJavaの基礎をしっかりマスターできる!",
        "categories": null
    },
    {
        "isbn": "9784295010333",
        "title": "いちばんやさしいJavaの教本 人気講師が教えるプログラミングの基礎",
        "authors": [
            "石井 真",
            "株式会社カサレアル"
        ],
        "description": "講義+実習のワークショップ形式で、 「シンプルなペットアプリ」を作りながら楽しく学べる 「はじめてでも挫折しない」Javaの入門書です。 なぜそうするのかを知りたい、 仕組みが知りたい、 応用できる基礎を身に付けたい、 そんな読者のさまざまな要望に応える新しい教本です。 講義パートの図解をまじえた解説で仕組みについて理解したあと、 実習パートで実際に手を動かしながらプログラムを書いていきます。 少しずつ新しいことを学びながら進み、プログラムに機能を追加していくので、 いま自分は何をやっているのかを、ちゃんと理解しながら進められます。 もし、つまずいても安心です。 短いレッスンを積み重ねた構成なので、 少し戻って再確認することもしやすくしています。 また、本書で学ぶサンプルプログラムのコードは、 サポートページからダウンロードできるので安心です。 ぜひ本書でJavaのプログラミングの楽しさを実感してください！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    },
    {
        "isbn": "9784297126858",
        "title": "プロになるJava―仕事で必要なプログラミングの知識がゼロから身につく最高の指南書",
        "authors": [
            "きしだなおき",
            "山本裕介",
            "杉山貴章"
        ],
        "description": null,
        "categories": null
    },
    {
        "isbn": "9784798167077",
        "title": "Java 第3版 実践編 アプリケーション作りの基本",
        "authors": [
            "三谷 純"
        ],
        "description": "プログラミング学習シリーズJavaが待望の改訂！ 本格的なアプリケーション作りに必要な知識を学ぼう！ 本書は、現在もっとも幅広く使われているプログラミング言語の1つ 「Java」の実践的な入門書です（本書をお読みいただくにあたって、 基礎的なJava言語仕様が前提知識となります。基礎的なJava言語仕様 については、本書シリーズ『Java 第3版 入門編』で解説しています）。 これまで多くの学生にJavaの授業をしてきた筆者が、その経験を活かし、 例外処理やコレクション、ファイルの読み書きといった、本格的な Javaプログラムを記述する際に知っておくべき基本を丁寧にわかりやすく 手ほどきします。これらを身につけることでできることの幅が広がり、 Javaプログラミングがぐっと楽しくなることでしょう。 また、パッケージやスレッド、GUI、ネットワークなど、本格的なアプリケーションを 作るために知っておきたい技術や、ガーベッジコレクションといった プログラマとして押さえておきたい知識にも触れます。 第3版では、Java11および最新の開発環境（Eclipse）に対応、 Swingを利用したGUIアプリケーションの作成など内容の最新化を行っています。 ・Javaプログラミングの実践的な知識を学びたい ・アプリケーション作成に必須の基礎を学びたい ・現場で通用する基礎を身につけたい という方におすすめの1冊です。",
        "categories": null
    },
    null,
    {
        "isbn": "9784295011248",
        "title": "スッキリわかるJava入門 実践編 第3版",
        "authors": [
            "中山 清喬",
            "株式会社フレアリンク"
        ],
        "description": "大手ネット書店ベストセラー1位『スッキリわかるJava入門』の、 正統続編である『実践編』に「第3版」が登場！ 最新Java17対応し、近年のJava改訂による新機能（Record等）の取り込みのほか、GitやMavenといったツール類の活用方法も具体的・実践的に解説！ エントリー書の『スッキリわかるJava入門』と同じく、新人エンジニア湊君の成長を傍らに、開発中に発生するJavaのいろんな「なぜ？」に、しっかりと答えながら解説が進んでいき、付録では「エラー解決・虎の巻」を用意して、独学に適した挫折しにくい紙面展開となっています。 各種API・設計手法・開発ツールに至るまで手広くカバーする構成で、中級者に進むあなたを効率的かつ、実践的にエスコートしていきます。 注目の改訂ポイントTOP 5は以下の通り。 【1】最新Java19対応 Record等の新機能紹介のほかJDK新ライセンスモデルの紹介 【2】Git入門（章を全面改訂） 昨今の開発現場に欠かせないGit/ブランチ/GitHubもマスター 【3】Maven（新節として追加） Java開発に不可欠なMaven/POMがわかる・かける 【4】WebAPI（新節として追加） HTTP/RESTの仕組みからマイクロサービス概念まで 【5】GUI開発(新章として追加) 開発現場で保守が続くSwing/AWTアプリにも対応 その他、令和の開発現場にフィットする追補改訂が盛りだくさん！ 発行：インプレス",
        "categories": [
            "Computers"
        ]
    }
]